Autodesk.Revit.DB.NumberingFormattedParameter.GetParameter
Get the target parameter for formatting.
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter.SetParameter(Autodesk.Revit.DB.NumberingParameter)
Set the target parameter for formatting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.NumberingFormattedParameter.Separator
Separators corresponding to the included parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter.Suffix
Suffix corresponding to the included parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter.SampleValue
Sample values corresponding to the included parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter.Prefix
Prefix corresponding to the included parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter.#ctor
Create an empty NumberingFormattedParameter object.
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter.#ctor(Autodesk.Revit.DB.NumberingFormattedParameter)
Copy the NumberingFormattedParameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormattedParameter
Settings for parameters associated in the numbering formatting.
Since:
2027